{
  "cs": [
    "Computer Science deals with the theory and practice of computer hardware and software. Students learn the theory that underlies computation and how to develop effective, efficient and correct software. The program is intensive in Mathematics and Computer Science courses.",

    "We offer a BSc. Degree in Computer Science and are focused on providing fluent understanding in several programming languages and as well as offer courses such as General Mathematics, Numerical Methods and Analysis , Data structures & algorithms, Artificial Intelligence & Data science, Networking & Operating Systems including numerous Programming languages to drive the economy forward.",

    "Computer Science careers include but are not limited to:",

    "Data Scientist, Software Tester, Software Developer, Web Developer, Computer System Analysts, Information Security Analyst, Project Manager, Network Administrator, Database Administrator, IT Architect, Computer Programmer, Hardware and Systems Engineer, UI/UX Designer."
  ],
  "cis": [
    "Computer Information Systems is the application of technology in managing the needs of businesses, so one will get to put technical skills to work in a business setting. Students in this major learn how to work with companies' IT systems to solve operations issues.",

    "We offer a BSc. Degree in Computer Science (Information) which is a blend of Computer Science as well as Management Sciences. Programming and Managerial courses are taught such as Economics, Cost Accounting, Enterprise Information System, Artificial Intelligence, Networking, Operating systems, E-Commerce as well as many other Programming Languages.",

    "Computer Information Systems careers include but are not limited to:",

    "Computer Systems Analyst, Software Engineer, Web Developer, Database Manager, Information Security Specialist, Network Administrator, Game Designer, Chief Technology Officer, Freelance Technology Consultant."
  ],
  "se": [
    "Software Engineering involves the design and development of many types of software, including operating systems software, network distribution software, and software for compilers. Software engineering requires strong programming skills as well as knowledge in mathematics, database administration, how operating systems work and how hardware interacts. ",

    "There are various fields in software engineering such as requirements gathering, software design, construction, maintenance, configuration management, engineering management, development process management and creation, engineering models and methods, quality etc.",

    "SWe offer a BSc. Degree in Software Engineering and courses such as Software Quality Engineering and Testing, Mobile App Design & Development, Artificial Intelligence, Software Measure and Metrics, Internet Technologies & Web App Development, Modelling & Simulation, Reverse Engineering and Malware Analysis and Cloud Computing Technologies.",

    "Software engineer careers include but are not limited to:",

    "Applications developer, Cyber security analyst, Game developer, Information systems manager, IT consultant, Multimedia programmer, Web developer, Web designer, Software engineer, Application analyst, Database administrator, Forensic computer analyst, IT technical support officer, Software tester, Sound designer, Systems analyst, Embedded Systems Engineer, Platform and Infrastructure Engineer, Software Architecture Engineer , Computer Systems Designer."
  ],
  "ct": [
    "Computer technology combines the hardware of computers and computer-controlled devices with software. ",

    "We offer a BSc. Degree in Computer Science and courses such as Applied Electricity, Basic Electronics, Computer Architecture, Advanced Digital Electronics, Circuit Design & Testing, Numerical Methods and Analysis, Compiler Construction, Fundamentals of Software Engineering, Assembly Language, Androids",

    "Computer Technology careers include but are not limited to:",

    "Systems Analyst, Network Administrator, Technician, Software Developer, Computer Hardware Engineers, Computer Network Architects, Computer Programmers, Database Administrators, Network and Computer Systems Administrators."
  ],
  "ict": [
    "The Information Communication Technology (ICT) program strives to educate students to assume leadership roles where the application of information technology is concerned with the ultimate goal of connecting people, organizations, and communities to enhance their ability to succeed. It is similar to Information Technology (IT), but focuses primarily on communication technologies.",

    "The course focuses on computer and network configurations, web and application programming, and database design and maintenance.  ICT students should have an understanding of computer systems, hardware and networks as well as problem solving, analytical skills and the ability to grasp large amounts of information and be able to quickly learn and adapt to new technologies and advances in the field.",

    "Careers in information and communication technology fields include a variety of roles and tasks associated with planning, researching, installing and monitoring the performance of IT systems. Careers in ICT include;",

    "Application analyst,Cyber security analyst,Data analyst,Database administrator,Information systems manager,IT consultant,IT technical support officer,Information security analyst,Penetration tester,Systems analyst."
  ]
}
